off/rotor/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    Inlet_in
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  0.363443;
        value               uniform (0 0 0);
        extrapolateProfile  no;
    }
    
    Outlet_vanes
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);
    }


    "(Wall_vanes|Shroud_imp|Wall_imp|Wall_in)"
    {
        type            noSlip;
    }



    "(Inlet_vanes|Inlet_imp|Outlet_imp|Outlet_in)"
    {
        type            cyclicAMI;
    }
}

// ************************************************************************* //
