off/rotor/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 4593.75;

boundaryField
{
    Inlet_in
    {
        type            fixedValue;
        value           uniform 4593.75;        
    }
    
    Outlet_vanes
    {
        type            inletOutlet;
        inletValue      uniform 4593.75;
    }

    "(Wall_vanes|Shroud_imp|Wall_imp|Wall_in)"
    {
        type            omegaWallFunction;
	      value		        $internalField;
    }

    "(Inlet_vanes|Inlet_imp|Outlet_imp|Outlet_in)"
    {
        type            cyclicAMI;
    }

}


// ************************************************************************* //
