off/rotor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    ami_1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1966;
        startFace       12214;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          394;
        startFace       14180;
    }
)

// ************************************************************************* //
