off/rotor/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

	{
		name	AMI1;
		type	faceSet;
		action  new;
		source  patchToFace;
		sourceInfo
		{
			patch	Outlet_in;
		}
	}


	{
		name	AMI1;
		type	faceSet;
		action  add;
		source  patchToFace;
		sourceInfo
		{
			patch	Inlet_imp;
		}
	}




	{
		name	AMI2;
		type	faceSet;
		action  new;
		source  patchToFace;
		sourceInfo
		{
			patch	Outlet_imp;
		}
	}


	{
		name	AMI2;
		type	faceSet;
		action  add;
		source  patchToFace;
		sourceInfo
		{
			patch	Inlet_vanes;
		}
	}


);

// ************************************************************************* //
